---
kind: property
id: P:Autodesk.Revit.UI.DoubleClickOptions.IsValidObject
source: html/a4ae2bd0-3676-c558-f186-a8e9ba9fa2ea.htm
---
# Autodesk.Revit.UI.DoubleClickOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.